bog_app/app/controllers/creatures_controller.rb

  def create
    creature = Creature.new(creature_params)
    if creature.save
---
INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Sir Didymus"], ["description", "fox-terrier who believes he is a great and chivalrous knight"], ["created_at", 2016-12-16 23:53:50 UTC], ["updated_at", 2016-12-16 23:53:50 UTC]]

  def show
    creature_id = params[:id]
    @creature = Creature.find_by_id(creature_id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def edit
    creature_id = params[:id]
    @creature = Creature.find_by_id(creature_id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    creature_id = params[:id]
    creature = Creature.find_by_id(creature_id)
    creature.update_attributes(creature_params)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "creatures" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "creatures"."id" = $4  [["name", "Moose"], ["description", "a mammal that looks like a big deer"], ["updated_at", 2016-12-17 00:14:10 UTC], ["id", 6]]

  def destroy
    creature_id = params[:id]
    creature = Creature.find_by_id(creature_id)
    creature.destroy
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 6]]